# -*- mode: org; -*-
#+TITLE: My emacs configuration
#+AUTHOR: Jim Hansson
#+EMAIL: jim.hansson@gmail.com
#+DATE: <2012-06-28 to>
#+LANGUAGE: English

This is my main .emacs file. It is responsible for calling out to the
local file at different points. This is placed in a git repository
that I share between work and home

*** TODO I don't want submodules to show up in git status
		:LOGBOOK:
		CLOCK: [2013-03-11 må 22:13]--[2013-03-11 må 22:52] =>  0:39
		:END:

***** Placeholder support in sql querys
			:LOGBOOK:
			- State "DONE"       from "TODO"       [2013-03-15 fr 15:55]
			CLOCK: [2013-03-15 fr 14:11]--[2013-03-15 fr 15:55] =>  1:44
			:END:

			#+begin_example emacs-lisp
        (eval-after-load "sql"
          '(load-library "sql-with-placeholders"))
        (add-hook 'sql-mode-hook (lambda nil
                                   (local-set-key [(control c) (control b)] 
                                                  'sql-send-buffer-with-placeholders)
                                   (local-set-key [(control c) (control c)] 
                                                  'sql-send-paragraph-with-placeholders)
                                   (local-set-key [(control c) (control r)] 
                                                  'sql-send-region-with-placeholders)))
        
			#+end_example
*** nXML
    :LOGBOOK:
    CLOCK: [2013-03-17 sö 12:08]--[2013-03-17 sö 13:23] =>  1:15
    :END:

    First we need a local place to store all relax ng files used to validate and provide
    completion, that is synced between machines.
    
    #+begin_src emacs-lisp
      ;; nxml is a part of the emacs distrobution so we don't need to have (when (require
      ;; .... 'noerror) around it, but we need to eval-after-load so the variable are
      ;; defined. 
      
      (eval-after-load "nxml-mode" 
        '(add-to-list 'rng-schema-locating-files
                      (concat local-emacs-org-dir "xml-schemas/schemas.xml")))
    #+end_src

    We want completion and other fun stuff

    #+begin_src emacs-lisp
      ;; just writing </ should be enaough to close last tag
      ;; ctrl tab to complete, this will do until we fixes w32 special keys things.
      (eval-after-load "nxml-mode"
        '(progn (setq nxml-slash-auto-complete-flag t)
                (define-key nxml-mode-map (kbd "C-<tab>") 'nxml-complete)))
    #+end_src

		#+begin_src emacs-lisp
      (add-to-list 'auto-mode-alist '("\\.html$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.rng$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.rss$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.sch$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.svg$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.wsdl$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.xml$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.xsd$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.xsl$" . nxml-mode))
      (add-to-list 'auto-mode-alist '("\\.xslt$" . nxml-mode))
		#+end_src
*** Org Capture
		:LOGBOOK:
		CLOCK: [2013-03-28 to 22:48]--[2013-03-28 to 23:26] =>  0:38
		:END:
		
		This is needed by both the [[Org-outlook integration]] and by 
		[[Org Protocol]]. First some basic setup of org-capture.

		We need some good capture templates. remember that the template
		"key" need to be exactly one character long for it to work with
		org-protocol.

		org-capture-templates is a list with structs the tells how and
		where things shall be put. first we clear it then we use
		add-to-list to append template after template.

		#+begin_src emacs-lisp
      ;; clear the templates list
      (setq org-capture-templates '())
      
      ;; next we start to add the templates we want.
      ;; This is the default one.
      (add-to-list 'org-capture-templates
                   ;; w has special meaning as a default for capture.
                   '("w"
                     "Default template"
                     entry
                     (file+headline "~/org/capture.org" "Notes")
                     "** %^{Title}
         Added: %U
         Source: %c
         %i
      "
                     :empty-lines 1))
      
      ;; This one is called from my integration in outlook throu org-protocol
      ;; Only useful on my workmachine but is not in the way on my home machine
      ;; Placeholders Replacement 
      ;; %:link URL of the email
      ;; %:description The title of the message
      ;; %:title The title of the message 
      ;; %:initial Selected text.
      ;; %:sender Sender's name
      ;; %:sender-email Sender's Email
      (add-to-list 'org-capture-templates
                   '("o"
                     "Outlook integration - creates items from mails."
                     entry
                     (file+headline "c:/Users/jiha/Documents/org/mdms/mdms.org" 
                                    "Inbox")
                     "** TODO %c
         Added: %U
         %?
      ,   #+begin_quote
           %:initial
      ,   #+end_quote
      "
                     :clock-resume
                     :empty-lines 1
                     :prepend))
      
      ;; This template is used to add notes to currently clocked-in work item.
      (add-to-list 'org-capture-templates
                   '("c"
                     "Add note to currently clocked-in item."
                     entry
                     (clock)
                     "** %^{Title}
         Added: %U
         %?"
                     :clock-keep
                     :empty-lines 1
                     :unnarrowed))
      
		#+end_src

  #+RESULTS:
	| c | Add note to currently clocked-in item.          | entry | (clock)                                                         | ** %^{Title}\n   Added: %U\n   %?                                                     | :clock-keep   | :empty-lines | 1 | :unnarrowed |
	| o | Outlook integration - creates items from mails. | entry | (file+headline c:/Users/jiha/Documents/org/mdms/mdms.org Inbox) | ** TODO %c\n   Added: %U\n   %?\n,   #+begin_quote\n     %:initial\n,   #+end_quote\n | :clock-resume | :empty-lines | 1 | :prepend    |
	| w | Default template                                | entry | (file+headline ~/org/capture.org Notes)                         | ** %^{Title}\n   Added: %U\n   Source: %c\n   %i\n                                    | :empty-lines  | 1            |   |             |

